Revit 2024 API
FormattedText.SetAllCapsStatus Method (TextRange, Boolean)
 Sets the characters in a given text range to be in all caps or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetAllCapsStatus(
	TextRange textRange,
	bool isAllCaps
)
Visual Basic
Public Sub SetAllCapsStatus ( _
	textRange As TextRange, _
	isAllCaps As Boolean _
)
Visual C++
public:
void SetAllCapsStatus(
	TextRange^ textRange,
	bool isAllCaps
)
Parameters
textRange
Type: Autodesk.Revit.DB.TextRange
 The given text range.
isAllCaps
Type: System.Boolean
 The desired all caps status of characters in the given text range. True will render all characters in all caps. False will revert the characters back to their original mixed case.
Remarks
 Removing the all caps status will revert the characters back to their original case. It will not make them lower case.
 The given text range should not be empty.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormattedText Class
SetAllCapsStatus Overload
Autodesk.Revit.DB Namespace